In [1]:
import pandas as pd

In [8]:
#Creating dataframe using pd.DataFrame
mydataset = {
    'cars': ["BMW", "Volvo", "Ford"],
    'passings': [3,7,3]
}
myvar = pd.DataFrame(mydataset)
print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         3

In [9]:
print(pd.__version__)

1.2.4

In [10]:
#Creating series using pd.Series
a = [1,7,2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [11]:
print(myvar[1])

7

In [14]:
#Creating Series with customized index.
index = ["x", "y", "z"]
a = [1,7,2]
myvar = pd.Series(a, index=index)
print(myvar)

x    1
y    7
z    2
dtype: int64

In [16]:
#Creating series using dictionary
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [19]:
#Creating dataframe using dictionary.
data = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

In [22]:
print(myvar.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [25]:
print(myvar.loc[[0,1]])

   calories  duration
0       420        50
1       380        40

In [27]:
print("Day1: ")
print(myvar.loc[0])
print("Day2: ")
print(myvar.loc[1])
print("Day3: ")
print(myvar.loc[2])

Day1:
calories    420
duration     50
Name: 0, dtype: int64
Day2:
calories    380
duration     40
Name: 1, dtype: int64
Day3:
calories    390
duration     45
Name: 2, dtype: int64

In [33]:
df = pd.read_csv("Salaries.csv")
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [36]:
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         76 non-null     float64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      76 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.8+ KB

In [39]:
pd.options.display.max_rows

60

In [41]:
df.isnull().sum()

rank          0
discipline    0
phd           2
service       0
sex           0
salary        2
dtype: int64

In [42]:
df.dropna(inplace=True)

In [43]:
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [45]:
df.fillna("Error", inplace=True)
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [46]:
df["salary"].fillna(45000, inplace=True)
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [48]:
for x in df.index:
    if df.loc[x, "salary"] > 100000:
        df.loc[x, "salary"] = 100000
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  100000.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  100000.0
3        Prof          A  40.0       31    Male  100000.0
4        Prof          B  20.0       18    Male  100000.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  100000.0
74  AssocProf          B  19.0        6  Female  100000.0
75       Prof          B  17.0       17  Female  100000.0
76       Prof          A  28.0       14  Female  100000.0
77       Prof          A  23.0       15  Female  100000.0

[74 rows x 6 columns]

In [52]:
df.duplicated().sum()

1